app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT * FROM "departments"

  def show
    @department = Department.find(params[:id])
---
SELECT * FROM "departments" WHERE ("departments"."id" = 1)

  def edit
    @department = Department.find(params[:id])
---
SELECT * FROM "departments" WHERE ("departments"."id" = 1)

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES('Graduate Research Lab', '2010-05-14 19:56:12', '2010-05-14 19:56:12')

  def update
    @department = Department.find(params[:id])
---
SELECT * FROM "departments" WHERE ("departments"."id" = 1)