app/controllers/jobs_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    if params[:user_id].nil?
      case params[:status]
        when "requested"
          conditions = "printed_at is NULL"
        when "printed"
          conditions = "printed_at is not NULL and paid_at is NULL"
        when "paid"
          conditions = "paid_at is not NULL"
        else
          conditions = ""
      end

      @jobs = Job.find :all, :conditions => conditions, :order => "paid_at, printed_at"

      @total = 0;
      for job in @jobs
        @total += job.discounted_total
      end

      @page_title = "Print jobs"
      @table_caption = ""
    else
      @user = User.find(params[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def create
    @user = User.find(params[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def pay
    #Pay selected jobs
    @page_title = "Receipt"
    if params[:job_ids].any?
      @user = User.find params[:user_id]