app/controllers/permissions_controller.rb

SELECT * FROM "permissions"
---
  def index
    @permissions = Permission.all

SELECT * FROM "permissions" WHERE ("permissions"."id" = 1)
---
  def show
    @permission = Permission.find(params[:id])

INSERT INTO "permissions" ("name", "created_at", "updated_at", "description") VALUES(NULL, '2010-05-25 18:54:50', '2010-05-25 18:54:50', NULL)
---
  def create
    @permission = Permission.new(params[:permission])

    respond_to do |format|
      if @permission.save

SELECT * FROM "permissions" WHERE ("permissions"."id" = 1)
DELETE FROM "permissions" WHERE "id" = 1
---
  def destroy
    @permission = Permission.find(params[:id])
    @permission.destroy