app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT * FROM "roles"

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 3)

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES('Admin', '2010-05-14 20:19:00', '2010-05-14 20:19:00')

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT * FROM "roles" WHERE ("roles"."id" = 4)
DELETE FROM "roles" WHERE "id" = 4