app/controllers/users_controller.rb

  def index
    #have to be logged in to see user list
    @users = User.all
---
SELECT * FROM "users" WHERE (first_name = 'Homer') LIMIT 1

  def create
    #logout_keeping_session!

    @user = User.new(params[:user])

    @user.role_id = Role.find_by_name("Customer").id unless current_user.is_an_admin?

    @user.graduation = nil unless @user.position = "student"

    @page_title = "Create new user account"

    success = @user && @user.save
    if success && @user.errors.empty?
---
SELECT * FROM "roles" WHERE ("roles"."name" = 'Customer') LIMIT 1
INSERT INTO "users" ("salt", "position", "created_at", "crypted_password", "remember_token_expires_at", "mica_id", "grad_date", "updated_at", "role_id", "remember_token", "last_name", "graduation", "phone", "login", "email", "first_name", "department_id") VALUES('2348f619b5462335e72d522957a8b925b3dc9750', 'Staff', '2010-05-14 17:01:20', '981f57971efb1c53bbcdfb5917c5a2347adb55e4', NULL, '360698', NULL, '2010-05-14 17:01:20', NULL, NULL, 'Egan', NULL, '4102302685', 'kegan', 'kegan@mica.edu', 'Kelly', NULL)
UPDATE "users" SET "role_id" = 3, "updated_at" = '2010-05-18 20:52:56', "department_id" = 293478 WHERE "id" = 5
SELECT * FROM "roles"

  def update
    @user = User.find(params[:id])
    @form_data = params[:user]
    @form_data[:role_id]= @user.role_id unless logged_in? and current_user.is_an_admin?
    unless @form_data[:position] == "Student"
      @form_data["graduation(1i)"] = ""
      @form_data["graduation(2i)"] = ""
      @form_data["graduation(3i)"] = ""
    end

    respond_to do |format|
      if @user.update_attributes(@form_data)
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "role_id" = '1', "updated_at" = '2010-05-14 20:53:08', "department_id" = '2', "crypted_password" = '34809e3436aa40fba9d27c83bfc8aa2d2ea4f346' WHERE "id" = 2

  def destroy
    if current_user.is_an_admin?
      @user = User.find(params[:id])
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 6

  def pay
    #Pay selected print jobs
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1